Revit 2025 API
AirCoolingCoilType Enumeration
 The type of air cooling coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AirCoolingCoilType
Public Enumeration AirCoolingCoilType
public enum class AirCoolingCoilType
type AirCoolingCoilType
Members
Member name | Value | Description
None | 0
ChilledWater | 1
DirectExpansion | 2
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace